Modules/Dashboard/Http/Controllers/DashboardController.php

    public function index()
    {
        try {
            return view('dashboard::dashboard', [
                'companies' => auth()->user()->companies()->get(),
            ]);
---
select * from `companies` where `user` = 7