Modules/Products/Http/Controllers/ProductsController.php

    public function store(CreateProductRequest $request)
    {
        try {
            $data            = $request->validated();
            $data['shopify'] = '0';
            $data['user']    = auth()->user()->id;
            $data['price']   = preg_replace("/[^0-9]/", "", $data['price']);
            $data['cost']    = preg_replace("/[^0-9]/", "", $data['cost']);
            $product         = $this->productModel->create($data);

            $productPhoto = $request->file('product_photo');

            if ($productPhoto != null) {

                try {
                    $img = Image::make($productPhoto->getPathname());
                    $img->crop($data['photo_w'], $data['photo_h'], $data['photo_x1'], $data['photo_y1']);
                    $img->resize(200, 200);
                    $img->save($productPhoto->getPathname());
---
update `products` set `deleted_at` = '2019-06-12 18:13:49', `products`.`updated_at` = '2019-06-12 18:13:49' where `id` = 1581