Modules/Plans/Http/Controllers/PlansController.php

    public function index(Request $request)
    {


        $requestData = $request->all();

        $plans = \DB::table('plans as plan')
                    ->whereNull('deleted_at');

        if (isset($requestData['projeto'])) {
            $plans = $plans->where('plan.project', '=', Hashids::decode($requestData['projeto']));
        } else {
            return response()->json('projeto não encontrado');
        }

        $plans = $plans->get([
                                 'plan.id',
                                 'plan.name',
                                 'plan.description',
                                 'plan.code',
                                 'plan.price',
                             ]);
---
select `plan`.`id`, `plan`.`name`, `plan`.`description`, `plan`.`code`, `plan`.`price` from `plans` as `plan` where `deleted_at` is null and `plan`.`project` = 74