Modules/Register/Http/Controllers/RegisterController.php

select * from `invitations` where `parameter` = '8ff9l0d5622ogmg' limit 1
---
    public function create($parameter)
    {

        $invite = Invitation::where('parameter', $parameter)->first();