Modules/Projects/Http/Controllers/ProjectsController.php

select * from `users_projects` where `user` = 7
---
    public function index()
    {
        try {
            $projectModel = new Project();

            $projects = $projectModel->whereHas('usersProjects', function($query) {
                $query->where('user', auth()->user()->id);
            })->get();

select * from `companies` where `user` = 7
select * from `projects` where `id` = 74 and `projects`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        try {
            $user = auth()->user()->load('companies');

            $projectModel = new Project();

            $idProject = current(Hashids::decode($id));
            $project   = $projectModel->with([
                                                       'usersProjects' => function($query) use ($user, $idProject) {
                                                           $query->where('user', $user->id)
                                                                 ->where('project', $idProject)->first();
                                                       },
                                                   ])->find($idProject);