Modules/Projects/Http/Controllers/ProjectsController.php

    public function index()
    {
        try {
            $projects = $this->getProject()->whereHas('usersProjects', function($query) {
                $query->where('user', auth()->user()->id);
            })->get();
---
select * from `users_projects` where (`user` = 7 and `project` = 74) limit 1