Modules/Sms/Http/Controllers/SmsController.php

select `sms`.`id`, `sms`.`event`, `sms`.`time`, `sms`.`period`, `sms`.`message`, `sms`.`status`, `plans`.`name` as `plan` from `zenvia_sms` as `sms` left join `plans` on `plans`.`id` = `sms`.`plan` where `sms`.`project` = 74
---
    public function dadosSms(Request $request) {

        $dados = $request->all();

        $sms = \DB::table('zenvia_sms as sms')
                    ->leftJoin('plans', 'plans.id', 'sms.plan');

        if(isset($dados['projeto'])){
            $sms = $sms->where('sms.project','=', Hashids::decode($dados['projeto']));
        }
        else{
            return response()->json('projeto não encontrado');
        }

        $sms = $sms->get([
                'sms.id',
                'sms.event',
                'sms.time',
                'sms.period',
                'sms.message',
                'sms.status',
                'plans.name as plan'
        ]);