Modules/Invites/Http/Controllers/InvitesController.php

    public function index()
    {

        $invites = $this->invitation->where('invite', auth()->user()->id)->get();
---
select * from `invitations` where `invite` = 7