Modules/Finances/Http/Controllers/FinancesController.php

select * from `companies` where `user` = 7
---
    public function index() {

        if(getenv('PAGAR_ME_PRODUCAO') == 'true'){
            $pagarMe = new Client(getenv('PAGAR_ME_PUBLIC_KEY_PRODUCAO'));
        }
        else{
            $pagarMe = new Client(getenv('PAGAR_ME_PUBLIC_KEY_SANDBOX'));
        }

        $userCompanies = Company::where('user', \Auth::user()->id)->get()->toArray();

select * from `companies` where `user` = 7
---
    public function extrato(Request $request){

        $userCompanies = Company::where('user', \Auth::user()->id)->get()->toArray();