Modules/Pixels/Http/Controllers/PixelsController.php

select `pixel`.`id`, `pixel`.`name`, `pixel`.`code`, `pixel`.`platform`, `pixel`.`status` from `pixels` as `pixel` where `pixel`.`project` = 74
---
    public function index(Request $request)
    {

        $dados = $request->all();

        $pixels = \DB::table('pixels as pixel');

        if (isset($dados['projeto'])) {
            $pixels = $pixels->where('pixel.project', '=', Hashids::decode($dados['projeto']));
        } else {
            return response()->json('projeto não encontrado');
        }

        $pixels = $pixels->get([
                                   'pixel.id',
                                   'pixel.name',
                                   'pixel.code',
                                   'pixel.platform',
                                   'pixel.status',
                               ]);